app/controllers/pages_controller.rb

SELECT  "tweets".* FROM "tweets"   ORDER BY "tweets"."id" DESC LIMIT 10
---
  def explore
    @tweets = Tweet.where("user_id in (?) OR user_id = ?", current_user.friend_ids, current_user).paginate(page: params[:page]).order('created_at DESC')
    @tweets = Tweet.all.last(10)

SELECT COUNT(*) FROM "tweets"  WHERE (tweet_text LIKE '%hii%')
SELECT  "tweets".* FROM "tweets"  WHERE "tweets"."id" = ? LIMIT 1  [["id", 1]]
---
  def search_results
    @tweets = Tweet.where("user_id in (?) OR user_id = ?", current_user.friend_ids, current_user).paginate(page: params[:page]).order('created_at DESC')
    @tweets = Tweet.search(params[:search])